{
  "navbar": {
    "home": "Home",
    "education": "Education",
    "portfolio": "Portfolio",
    "experiences": "Experiences",
    "contact": "Get in Touch",
    "language": "Language"
  },
  "banner": {
    "greeting": "Hello",
    "introduction": "I'm",
    "profession": "a"
  },
  "about": {
    "title": "About Me",
    "text-p1": "I have a Bachelor's degree in Technology in Web Systems, where I specialized in Web Development, learning technologies such as HTML, CSS, and Javascript for the Frontend and Node JS, Ruby on Rails, and PHP Laravel for the Backend. In the area of Web Security, I gained experience in Cyber Defense, which was my research project for the final thesis.",
    "text-p2": "With over five years of experience as a Programming Professor, I have refined my teaching strategies to convey knowledge in Web Development and various Frameworks to a diverse student base. My expertise also extends to mentoring in Digital Game Development, Robotics, and IoT.",
    "text-p3": "Recently, I developed a Recommendation System using Java Spring Boot for a distance education company. I acquired analytical skills involving statistical processes through the application of Mathematical Methods in Computing. Additionally, I have also worked on software performance and the R language."
  },
  "education": {
    "title": "Education",
    "postgraduate": {
      "university": "Federal University of Technology - Paraná",
      "title": "Postgraduate - Artificial Intelligence",
      "period": "November 2024 - November 2026",
      "description": "Specialization focused on developing AI software for robotics, data analysis, speech and image recognition; working with data engineering and big data; providing consulting for AI application in business strategies, and developing efficient solutions for medicine and industry."
    },
    "master": {
      "university": "State University of Western Paraná",
      "title": "Master's Degree - Applied Computing Methods",
      "period": "July 2021 - February 2024",
      "description": "The work titled \"Study Recommendation in the AlfaCon Public Competitions Virtual Learning Environment: studies with a RESTful API\" discusses the creation of an API integrated into the AlfaCon system, focused on recommending personalized study plans for registered students. This API, based on the Theory of Meaningful Learning, utilizes assessment models from Classical Test Theory (CTT) and Item Response Theory (IRT). The tool aims to enhance the learning process by offering more precise and tailored recommendations to meet the individual needs of students. For more details, visit ",
      "link": "<a class=\"text-link\" target=\"_blank\" href=\"https://tede.unioeste.br/handle/tede/7232\">the link.</a>"
    },
    "bachelor": {
      "university": "Federal University of Technology - Paraná",
      "title": "Bachelor's Degree in Information Technology - Web Systems",
      "period": "March 2017 - May 2021",
      "description": "Focused on building complete and innovative digital solutions for web and mobile, mastering all stages of the process with high quality, security, and usability. Final Thesis in the Information Security discipline, titled: A Comparative Study Between Secure Software Development Processes. For more details, visit ",
      "link": "<a class=\"text-link\" target=\"_blank\" href=\"https://repositorio.utfpr.edu.br/jspui/handle/1/25955\">the link.</a>"
    }
  },
  "portfolio": {
    "title": "Portfolio",
    "subtitle": "What I have done",
    "project-1": {
      "title": "RAG System",
      "text": "Retrieval-Augmented Generation (RAG) system developed in Python. The pipeline processes and splits (chunks) documents, generates embeddings using Hugging Face models, and stores them in ChromaDB. When a user asks a question, the system retrieves the relevant context from ChromaDB and injects it into a prompt for an LLM (such as Llama 2), which then generates an accurate, fact-based response.",
      "button": "View Project"
    },
    "project-2": {
      "title": "Dynamic Study Planner",
      "text": "Stateless RESTful API built with Spring Boot, using a Genetic Algorithm to determine the strategic allocation of effort among subjects, with its fitness function calibrated by principles of Meaningful Learning. A tactical scheduling engine applies heuristics based on the Forgetting Curve theory (for spaced repetition) and Cognitive Load theory (for balancing daily study intensity).",
      "button": "View Project"
    },
    "project-3": {
      "title": "Student Cognitive Load Predictor",
      "text": "Uses Python to estimate the student's cognitive load by combining course data and well-being information. With Pandas for data processing, the system applies Scikit-learn models (such as Linear and Logistic Regression) to objectively analyze and weight course difficulty factors and student stress indicators (Distress vs. Eustress). The result is a unified cognitive load score normalized using MinMaxScaler.",
      "button": "View Project"
    },
    "project-4": {
      "title": "Recommendation API",
      "text": "Developed in Java using the Spring Boot framework to facilitate the creation of RESTful services. The MySQL database stores the information, with JPA managing the database interaction. To perform statistical calculations and data analysis, the Apache Commons Math, jfreechart, RCaller, and Apache Mahout libraries were used.",
      "button": "View Project"
    },
    "project-5": {
      "title": "Recommendation Report",
      "text": "The system's frontend was built using HTML, CSS, and JavaScript, with the Bootstrap 5 framework to create a responsive and modern interface. The ApexCharts library was used to generate interactive charts, while the jsPDF and html2canvas libraries enable converting the HTML template into a PDF document.",
      "button": "View Project"
    },
    "project-6": {
      "title": "Reopen Genesis Pass",
      "text": "Using Bootstrap 5, CSS3, HTML5, JavaScript, and jQuery, I was responsible for building the frontend interface of this website. Through a responsive and intuitive design, I created a pleasant user experience that reflects the brand’s visual identity.",
      "button": "View Project"
    },
    "project-7": {
      "title": "Gamo Rei Store",
      "text": "On the backend, Node.js provided a scalable and efficient architecture, especially with Express for route creation and MongoDB as the database. On the frontend, React.js was essential for building a dynamic and responsive user interface, using JSX for smooth integration between HTML and JavaScript, along with reusable components.",
      "button": "View Project"
    },
    "project-8": {
      "title": "Gamo Rei App",
      "text": "Android application developed for an online store using Kotlin. It uses Room for local database management and ViewModel for efficient lifecycle management of activities. In addition, I implemented the MVVM (Model-View-ViewModel) architecture to clearly separate responsibilities, making the code organized and easy to maintain.",
      "button": "View Project"
    },
    "project-9": {
      "title": "Gym App",
      "text": "Android application developed for a gym using Kotlin, focusing on features that optimize management and user engagement. I integrated Firebase to manage the cloud database. Additionally, I used Firebase Authentication for a secure and efficient login system and Firebase Cloud Messaging for sending personalized notifications.",
      "button": "View Project"
    }
  },
  "languages": {
    "title": "Experience",
    "subtitle": "Programming Languages and Frameworks"
  },
  "contact": {
    "title": "Get in Touch",
    "subtitle": "Want to get in touch with me? Send a message by clicking the button below",
    "button": "Send Message"
  },
  "footer": {
    "text": "Developed by"
  }
}
