{
  "navbar": {
    "home": "Inicio",
    "education": "Educación",
    "portfolio": "Portafolio",
    "experiences": "Experiencias",
    "contact": "Contacto",
    "language": "Idioma"
  },
  "banner": {
    "greeting": "Hola",
    "introduction": "Me llamo",
    "profession": "soy"
  },
  "about": {
    "title": "Sobre mí",
    "text-p1": "Tengo una licenciatura en Tecnología en Sistemas para Internet, donde me especialicé en Desarrollo Web, aprendiendo tecnologías como HTML, CSS y Javascript para el Frontend y Node JS, Ruby on Rails y PHP Laravel para el Backend. En el área de Seguridad Web, adquirí experiencia en Defensa Cibernética, siendo este mi proyecto de investigación para la tesis final.",
    "text-p2": "Con más de cinco años de experiencia como Profesor de Programación, he desarrollado mis estrategias de enseñanza para transmitir conocimientos en Desarrollo Web y diversos Frameworks a una base diversa de estudiantes. Mi experiencia también se extiende a la mentoría en Desarrollo de Juegos Digitales, Robótica e IoT.",
    "text-p3": "Recientemente desarrollé un Sistema de Recomendación utilizando Java Spring Boot para una empresa de educación a distancia. Adquirí habilidades analíticas que involucran procesos estadísticos mediante la aplicación de Métodos Matemáticos en la Computación. Además, también trabajé en la optimización de software y en el lenguaje R."
  },
  "education": {
    "title": "Capacitación",
    "postgraduate": {
      "university": "Universidad Tecnológica Federal de Paraná",
      "title": "Especialización - Programación para Dispositivos Móviles",
      "period": "Mayo de 2024 - Mayo de 2026",
      "description": "Especialización centrada en el desarrollo de software de IA para robótica, análisis de datos, reconocimiento de voz e imagen; trabajar con ingeniería de datos y big data; ofrecer consultoría para la aplicación de IA en estrategias empresariales y desarrollar soluciones eficientes para la medicina y la industria."
    },
    "master": {
      "university": "Universidad Estatal del Oeste de Paraná",
      "title": "Maestría - Métodos de Computación Aplicada",
      "period": "Julio de 2021 - Febrero de 2024",
      "description": "El trabajo titulado \"Recomendación de Estudios en el Entorno Virtual de Aprendizaje de AlfaCon Concursos Públicos: estudios con una API RESTful\" aborda la creación de una API integrada en el sistema de AlfaCon, enfocada en recomendar planes de estudio personalizados para estudiantes registrados. Esta API, basada en la Teoría del Aprendizaje Significativo, utiliza modelos de evaluación basados en la Teoría Clásica de los Tests (TCT) y la Teoría de Respuesta al Ítem (TRI). La herramienta tiene como objetivo mejorar el proceso de aprendizaje al ofrecer recomendaciones más precisas y adecuadas a las necesidades individuales de los estudiantes. Para más detalles, visite ",
      "link": "<a class=\"text-link\" target=\"_blank\" href=\"https://tede.unioeste.br/handle/tede/7232\">el enlace.</a>"
    },
    "bachelor": {
      "university": "Universidad Tecnológica Federal de Paraná",
      "title": "Licenciatura en Tecnología de la Información - Sistemas para Internet",
      "period": "Marzo de 2017 - Mayo de 2021",
      "description": "Enfocado en la construcción de soluciones digitales completas e innovadoras para web y mobile, dominando todas las etapas del proceso con alta calidad, seguridad y usabilidad. Trabajo de Tesis en la asignatura de Seguridad de la Información, con el título: Un estudio comparativo entre procesos de desarrollo de software seguro. Para más detalles, visite ",
      "link": "<a class=\"text-link\" target=\"_blank\" href=\"https://repositorio.utfpr.edu.br/jspui/handle/1/25955\">el enlace.</a>"
    }
  },
  "portfolio": {
    "project-1": {
      "title": "Título del proyecto",
      "text": "Descripción del proyecto",
      "button": "Ver más"
    },
    "project-2": {
      "title": "Título del proyecto",
      "text": "Descripción del proyecto",
      "button": "Ver más"
    },
    "project-3": {
      "title": "Título del proyecto",
      "text": "Descripción del proyecto",
      "button": "Ver más"
    },
    "project-4": {
      "title": "Título del proyecto",
      "text": "Descripción del proyecto",
      "button": "Ver más"
    }
  },
  "languages": {
    "title": "Experiencias",
    "subtitle": "Lenguajes de programación y Frameworks"
  },
  "contact": {
    "title": "Ponte en contacto",
    "subtitle": "¿Quieres ponerte en contacto conmigo? Envía un mensaje haciendo clic en el botón de abajo",
    "button": "Enviar mensaje"
  },
  "footer": {
    "text": "Desarrollado por"
  }
}
