{
  "navbar": {
    "home": "Inicio",
    "education": "Capacitación",
    "portfolio": "Portafolio",
    "experiences": "Experiencias",
    "contact": "Contacto",
    "language": "Idioma"
  },
  "banner": {
    "greeting": "Hola",
    "introduction": "Me llamo",
    "profession": "soy"
  },
  "about": {
    "title": "Sobre mí",
    "text-p1": "Tengo una licenciatura en Tecnología en Sistemas para Internet, donde me especialicé en Desarrollo Web, aprendiendo tecnologías como HTML, CSS y Javascript para el Frontend y Node JS, Ruby on Rails y PHP Laravel para el Backend. En el área de Seguridad Web, adquirí experiencia en Defensa Cibernética, siendo este mi proyecto de investigación para la tesis final.",
    "text-p2": "Con más de cinco años de experiencia como Profesor de Programación, he desarrollado mis estrategias de enseñanza para transmitir conocimientos en Desarrollo Web y diversos Frameworks a una base diversa de estudiantes. Mi experiencia también se extiende a la mentoría en Desarrollo de Juegos Digitales, Robótica e IoT.",
    "text-p3": "Recientemente desarrollé un Sistema de Recomendación utilizando Java Spring Boot para una empresa de educación a distancia. Adquirí habilidades analíticas que involucran procesos estadísticos mediante la aplicación de Métodos Matemáticos en la Computación. Además, también trabajé en la optimización de software y en el lenguaje R."
  },
  "education": {
    "title": "Capacitación",
    "postgraduate": {
      "university": "Universidad Tecnológica Federal de Paraná",
      "title": "Especialización - Inteligencia Artificial",
      "period": "Noviembre de 2024 - Noviembre de 2026",
      "description": "Especialización centrada en el desarrollo de software de IA para robótica, análisis de datos, reconocimiento de voz e imagen; trabajar con ingeniería de datos y big data; ofrecer consultoría para la aplicación de IA en estrategias empresariales y desarrollar soluciones eficientes para la medicina y la industria."
    },
    "master": {
      "university": "Universidad Estatal del Oeste de Paraná",
      "title": "Maestría - Métodos de Computación Aplicada",
      "period": "Julio de 2021 - Febrero de 2024",
      "description": "El trabajo titulado \"Recomendación de Estudios en el Entorno Virtual de Aprendizaje de AlfaCon Concursos Públicos: estudios con una API RESTful\" aborda la creación de una API integrada en el sistema de AlfaCon, enfocada en recomendar planes de estudio personalizados para estudiantes registrados. Esta API, basada en la Teoría del Aprendizaje Significativo, utiliza modelos de evaluación basados en la Teoría Clásica de los Tests (TCT) y la Teoría de Respuesta al Ítem (TRI). La herramienta tiene como objetivo mejorar el proceso de aprendizaje al ofrecer recomendaciones más precisas y adecuadas a las necesidades individuales de los estudiantes. Para más detalles, visite ",
      "link": "<a class=\"text-link\" target=\"_blank\" href=\"https://tede.unioeste.br/handle/tede/7232\">el enlace.</a>"
    },
    "bachelor": {
      "university": "Universidad Tecnológica Federal de Paraná",
      "title": "Licenciatura en Tecnología de la Información - Sistemas para Internet",
      "period": "Marzo de 2017 - Mayo de 2021",
      "description": "Enfocado en la construcción de soluciones digitales completas e innovadoras para web y mobile, dominando todas las etapas del proceso con alta calidad, seguridad y usabilidad. Trabajo de Tesis en la asignatura de Seguridad de la Información, con el título: Un estudio comparativo entre procesos de desarrollo de software seguro. Para más detalles, visite ",
      "link": "<a class=\"text-link\" target=\"_blank\" href=\"https://repositorio.utfpr.edu.br/jspui/handle/1/25955\">el enlace.</a>"
    }
  },
  "portfolio": {
    "title": "Portafolio",
    "subtitle": "Lo que he hecho",
    "project-1": {
      "title": "Sistema RAG",
      "text": "Sistema de Generación Aumentada por Recuperación (RAG) desarrollado en Python. El pipeline procesa y divide (chunking) los documentos, genera embeddings con modelos de Hugging Face y los almacena en ChromaDB. Cuando un usuario realiza una pregunta, el sistema recupera el contexto relevante desde ChromaDB y lo inyecta en un prompt para un LLM (como Llama 2), que luego genera una respuesta precisa y basada en los hechos recuperados.",
      "button": "Ver Proyecto"
    },
    "project-2": {
      "title": "Planificador de Estudios Dinámico",
      "text": "API RESTful sin estado construida con Spring Boot, que utiliza un Algoritmo Genético para determinar la asignación estratégica del esfuerzo entre las materias, con su función de fitness calibrada por principios del Aprendizaje Significativo. Un motor de programación táctica aplica heurísticas basadas en las teorías de la Curva del Olvido (para la repetición espaciada) y de la Carga Cognitiva (para equilibrar la intensidad diaria de estudio).",
      "button": "Ver Proyecto"
    },
    "project-3": {
      "title": "Predicción de la Carga Cognitiva de los Estudiantes",
      "text": "Utiliza Python para estimar la carga cognitiva del estudiante, combinando datos de los cursos y de bienestar. Con Pandas para el procesamiento de datos, el sistema aplica modelos de Scikit-learn (como la Regresión Lineal y Logística) para analizar y ponderar objetivamente los factores de dificultad del curso y los indicadores de estrés del alumno (Distress vs. Eustrés). El resultado es una puntuación unificada de carga cognitiva, normalizada con MinMaxScaler.",
      "button": "Ver Proyecto"
    },
    "project-4": {
      "title": "API de Recomendación",
      "text": "Desarrollada en Java, utilizando el framework Spring Boot para facilitar la creación de servicios RESTful. La base de datos MySQL almacena la información, con JPA interactuando con la base de datos. Para realizar cálculos estadísticos y análisis de datos, se utilizaron las bibliotecas Apache Commons Math, jfreechart, RCaller y Apache Mahout.",
      "button": "Ver Proyecto"
    },
    "project-5": {
      "title": "Informe de Recomendación",
      "text": "El frontend del sistema fue construido utilizando HTML, CSS y JavaScript, con el framework Bootstrap 5 para crear una interfaz moderna y responsiva. La biblioteca ApexCharts fue utilizada para generar gráficos interactivos, mientras que jsPDF y html2canvas permiten convertir la plantilla HTML en un documento PDF.",
      "button": "Ver Proyecto"
    },
    "project-6": {
      "title": "Reopen Genesis Pass",
      "text": "Utilizando Bootstrap 5, CSS3, HTML5, JavaScript y jQuery, fui responsable de construir la interfaz frontend de este sitio web. A través de un diseño responsivo e intuitivo, logré crear una experiencia de usuario agradable que refleja la identidad visual de la marca.",
      "button": "Ver Proyecto"
    },
    "project-7": {
      "title": "Gamo Rei Store",
      "text": "En el backend, Node.js proporcionó una arquitectura escalable y eficiente, especialmente con el uso de Express para la creación de rutas y de MongoDB como base de datos. En el frontend, React.js fue esencial para crear una interfaz de usuario dinámica y responsiva, utilizando JSX para una integración fluida entre HTML y JavaScript, además de componentes reutilizables.",
      "button": "Ver Proyecto"
    },
    "project-8": {
      "title": "Gamo Rei App",
      "text": "Aplicación Android desarrollada para una tienda virtual utilizando Kotlin. Se usa Room para la gestión de la base de datos local y ViewModel para la gestión eficiente del ciclo de vida de las actividades. Además, implementé la arquitectura MVVM (Model-View-ViewModel) para separar las responsabilidades de manera clara, organizada y fácil de mantener.",
      "button": "Ver Proyecto"
    },
    "project-9": {
      "title": "Gym App",
      "text": "Aplicación Android desarrollada para un gimnasio utilizando Kotlin, centrada en funcionalidades que optimizan la gestión y el compromiso de los usuarios. Integré Firebase para gestionar la base de datos en la nube. Además, utilicé Firebase Authentication para un sistema de inicio de sesión seguro y eficiente, y Firebase Cloud Messaging para el envío de notificaciones personalizadas.",
      "button": "Ver Proyecto"
    }
  },
  "languages": {
    "title": "Experiencias",
    "subtitle": "Lenguajes de programación y Frameworks"
  },
  "contact": {
    "title": "Ponte en contacto",
    "subtitle": "¿Quieres ponerte en contacto conmigo? Envía un mensaje haciendo clic en el botón de abajo",
    "button": "Enviar mensaje"
  },
  "footer": {
    "text": "Desarrollado por"
  }
}
