{
  "navbar": {
    "home": "Início",
    "education": "Formação",
    "portfolio": "Portifólio",
    "experiences": "Experiências",
    "contact": "Contato",
    "language": "Idioma"
  },
  "banner": {
    "greeting": "Olá",
    "introduction": "Me chamo",
    "profession": "sou"
  },
  "about": {
    "title": "Sobre mim",
    "text-p1": "Possuo graduação em Tecnologia em Sistemas para Internet, onde me aprofundei em Desenvolvimento Web, aprendendo tecnologias como HTML, CSS e Javascript para o Frontend e Node JS, Ruby on Rails e PHP Laravel para o Backend. Na parte de Segurança Web, obtive experiências com Defesa Cibernética, sendo este meu projeto de pesquisa de conclusão de curso.",
    "text-p2": "Com mais de cinco anos de experiência como Professor de Programação, evoluí minhas estratégias de ensino para transmitir conhecimento em Desenvolvimento Web e diversos Frameworks para uma base de alunos diversificada. Minha expertise também se estende à mentorias em Desenvolvimento de Jogos Digitais, Robótica e IoT.",
    "text-p3": "Recentemente desenvolvi um Sistema de Recomendação utilizando Java Spring Boot para uma empresa de educação a distância. Adquiri habilidades analíticas que envolvem processos estatísticos através da aplicação de Métodos Matemáticos na Computação. Além disso, também trabalhei com performance de software e linguagem R."
  },
  "education": {
    "title": "Formação",
    "postgraduate": {
      "university": "Universidade Tecnológica Federal do Paraná",
      "title": "Especialização - Inteligência Artificial",
      "period": "Novembro de 2024 - Novembro de 2026",
      "description": "Especialização focada em desenvolver softwares de IA para robótica, análise de dados, reconhecimento de fala e imagem; atuar com engenharia de dados e big data; oferecer consultoria para aplicação de IA em estratégias de negócios e, ainda, desenvolver soluções eficientes para a medicina e a indústria."
    },
    "master": {
      "university": "Universidade Estadual do Oeste do Paraná",
      "title": "Mestrado - Métodos de Computação Aplicada",
      "period": "Julho de 2021 - Fevereiro de 2024",
      "description": "Trabalho intitulado \"Recomendação de Estudos no Ambiente Virtual de Aprendizado do AlfaCon Concursos Públicos: estudos com uma API RESTful\" aborda a criação de uma API acoplada ao sistema do AlfaCon, focada em recomendar estudos personalizados para alunos cadastrados. Essa API, fundamentada na Teoria da Aprendizagem Significativa, emprega modelos de avaliação baseados na Teoria Clássica dos Testes (TCT) e na Teoria de Resposta ao Item (TRI). Com isso, a ferramenta visa melhorar o processo de aprendizado ao oferecer recomendações mais precisas e adequadas às necessidades individuais dos estudantes. Para mais detalhes, acesse ",
      "link": "<a class=\"text-link\" target=\"_blank\" href=\"https://tede.unioeste.br/handle/tede/7232\">o link.</a>"
    },
    "bachelor": {
      "university": "Universidade Tecnológica Federal do Paraná",
      "title": "Graduação em Tecnologia da Informação - Sistemas para Internet",
      "period": "Março 2017 - Maio 2021",
      "description": "Focado na construção de soluções digitais completas e inovadoras para web e mobile, dominando todas as etapas do processo com alta qualidade, segurança e usabilidade. Trabalho de Conclusão de Curso na disciplina de Segurança da Informação, com o título: Um estudo comparativo entre processos de desenvolvimento de software seguro. Para mais detalhes, acesse ",
      "link": "<a class=\"text-link\" target=\"_blank\" href=\"https://repositorio.utfpr.edu.br/jspui/handle/1/25955\">o link.</a>"
    }
  },
  "portfolio": {
    "title": "Portifólio",
    "subtitle": "O que eu já fiz",
    "project-1": {
      "title": "RAG System",
      "text": "Sistema de Geração Aumentada por Recuperação (RAG) desenvolvido em Python. O pipeline processa e divide (chunking) documentos, gera embeddings com modelos Hugging Face e os armazena no ChromaDB. Quando um usuário faz uma pergunta, o sistema recupera o contexto relevante do ChromaDB e o injeta em um prompt para um LLM (como Llama 2), que então gera uma resposta precisa e baseada nos fatos recuperados.",
      "button": "Ver Projeto"
    },
    "project-2": {
      "title": "Planeador de Estudos Dinâmico",
      "text": "API RESTful stateless construída com Spring Boot, utiliza um Algoritmo Genético para determinar a alocação estratégica de esforço entre disciplinas, com sua função de fitness calibrada por princípios da Aprendizagem Significativa. Um motor de agendamento tático aplica heurísticas baseadas nas teorias da Curva de Esquecimento (para repetição espaçada) e da Carga Cognitiva (para balanceamento da intensidade diária de estudo).",
      "button": "Ver Projeto"
    },
    "project-3": {
      "title": "Preditor da Carga Cognitiva de Estudantes",
      "text": "Utiliza Python para estimar a carga cognitiva do estudante, combinando dados de cursos e dados de bem-estar. Com Pandas para processamento de dados, o sistema aplica modelos do Scikit-learn (como Regressão Linear e Logística) para analisar e ponderar objetivamente fatores de dificuldade do curso e indicadores de stress do aluno (Distress vs. Eustress). O resultado é um score de carga cognitiva unificado, normalizado com MinMaxScaler.",
      "button": "Ver Projeto"
    },
    "project-4": {
      "title": "API de Recomendação",
      "text": "Desenvolvida em Java, utilizando o framework Spring Boot para facilitar a criação de serviços RESTful. O banco de dados MySQL armazena as informações, com o JPA interagindo com o banco. Para realizar cálculos estatísticos e análises de dados, foram utilizadas as bibliotecas Apache Commons Math, jfreechart, RCaller e Apache Mahout.",
      "button": "Ver Projeto"
    },
    "project-5": {
      "title": "Relatório de Recomendação",
      "text": "O frontend do sistema foi construído utilizando as tecnologias HTML, CSS e JavaScript, com o framework Bootstrap 5 para criar uma interface responsiva e moderna. A biblioteca ApexCharts foi empregada para gerar gráficos interativos, enquanto as bibliotecas jsPDF e html2canvas possibilitam a conversão do template HTML em um documento PDF.",
      "button": "Ver Projeto"
    },
    "project-6": {
      "title": "Reopen Genesis Pass",
      "text": "Utilizando Bootstrap 5, CSS3, HTML5, JavaScript e jQuery, fui responsável por construir a interface frontend deste site. Através de um design responsivo e intuitivo, consegui criar uma experiência de usuário agradável que reflete a identidade visual da marca.",
      "button": "Ver Projeto"
    },
    "project-7": {
      "title": "Gamo Rei Store",
      "text": "No backend, Node.js proporcionou uma arquitetura escalável e eficiente, especialmente com o uso do Express para a criação de rotas e do MongoDB como banco de dados. No frontend, React.js foi essencial para criar uma interface de usuário dinâmica e responsiva, utilizando o JSX para uma integração fluida entre HTML e JavaScript, além de componentes reutilizáveis.",
      "button": "Ver Projeto"
    },
    "project-8": {
      "title": "Gamo Rei App",
      "text": "Aplicativo Android desenvolvido para uma loja virtual utilizando Kotlin. Uso do Room para o gerenciamento de banco de dados local e do ViewModel para a gestão eficiente do ciclo de vida das atividades. Além disso, implementei a arquitetura MVVM (Model-View-ViewModel) para separar as responsabilidades de forma clara, organizada e fácil de manter.",
      "button": "Ver Projeto"
    },
    "project-9": {
      "title": "Gym App",
      "text": "Aplicativo Android desenvolvido para uma academia utilizando Kotlin, focando em funcionalidades que otimizam a gestão e o engajamento dos usuários. Integrei o Firebase para gerenciar o banco de dados em nuvem. Além disso, utilizei o Firebase Authentication para um sistema de login seguro e eficiente, e o Firebase Cloud Messaging para o envio de notificações personalizadas.",
      "button": "Ver Projeto"
    }
  },
  "languages": {
    "title": "Experiências",
    "subtitle": "Linguagens de programação e Frameworks"
  },
  "contact": {
    "title": "Entre em contato",
    "subtitle": "Quer entrar em contato comigo? Envie uma mensagem clicando no botão abaixo",
    "button": "Enviar mensagem"
  },
  "footer": {
    "text": "Desenvolvido por"
  }
}
